// Для задас можно создовать отдельные переменные но это неудобно потому что есть массив\
/* let task1 = 'Сделать дз по JS 
let task2 = 'Подключиться к уроку'
let task3 = 'Прочитать 100 страниц'*/


// Массив - как переменная, только хранит в себе множество значений
/* const tasks = ['Сделать дз по JS', 'Подключиться к уроку', 'Прочитать 100 страниц', 10, true]


console.log((tasks))
console.log(tasks[0])
console.log(tasks[2]) */




/* ===================== Методы для массивов ======================== */
const fruits = ['Apple', 'Banana']

// push - добавляет в конец новый элемент
/* fruits.push('Orange')
console.log(fruits) */

// pop - удаляет пеоследний элемент в массиве
/* fruits.pop()
console.log() */

// unschift - добавляет в начало массива новый элемент
/* fruits.unshift()
console.log(fruits) */

// schift - удаляет первый элемент массива
/* fruits.schift()
console.log(fruits) */




// splice – многофункциональное удаление, замена, вставка

// start – с какого индекса начать
// deleteCount – сколько элементов удалить
// item1, item2, ... – что вставить вместо удалённых

// Добавим в существующий массив несколько удалённых фруктов
fruits.push('Orange', 'Kiwi')
console.log(fruits) // выведет ['Apple', 'Banana', 'Orange', 'Kiwi']

//Удалить элемент
fruits.splice(1, 2) // начиная с индекса 1 удалили 2 элемента ('Banana', 'Orange')
console.log(fruits) // выведет ['Apple', 'Kiwi']

// Заменить элемент
fruits.splice(1, 1, 'Grape') // с индекса 1 удалили 1 элемент и вставь туда "Grape"
console.log(fruits) // выведет ['Apple', 'Grape']

// Вставить новые элементы (ничего не удаляя)
fruits.splice(2, 0, 'Pear', 'Melon') // начиная с индекса 2, вставь "Pear" И "Melon"
console.log(fruits) // выведет ['Apple', 'Grape', 'Pear', 'Melon']






/* создайте список продуктов "Молоко", "Сыр", "Хлеб" и после:

Добавьте в список "Морковь", чтобы он стал вторым по порядку продуктом
Удалите продукт из списка: Удалите "Хлеб" из списка продуктов
Замените продукт в списке: Замените "Сыр" на "Масло" в списке продуктов */

console.log('\nПрактика splice\n\n')
const list = ["Молоко", "Сыр", "Хлеб"]

list.splice(1, 0, 'Морковь')

list.splice(3, 1)

list.splice(2, 1, 'Масло')

console.log(list);


// Длина (кол-во) элементв в массиве
console.log(`В массиве ${list.length} элементов`);


