// i это - переменная с которой всй начинается, изначально равна нулю
// i <= 10 до какого значения весь цикл будет работать
// i++ как будет изменятся переменная, например с каким промежутком (интерацией) цикла она будет меняться, например прибовляться по одному
// Итерация – это один проход (повтор) цикла. Например если цикл выполнился 5 раз – значит было 5 итераций.

// ++ это ИНКРЕМЕНТ, сокращение от i = i + 1
// -- это ДЕКРЕМЕНТ, сокращениее от i = i - 1


// for (let i = 1; i <= 10; i++) {
//     setTimeout(() => {
//         console.log(i);
//     }, i * 1000)
// }


// for (let i = 10; i >= 0; i--) {
//     console.log(i);
// }


// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//     sum += i;
// }
// console.log("Сумма чисел от 1 до 100 =", sum);

// let sum = 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10 + 11 + 12 + 13 + 14 + 15 + 16 + 17 + 18 + 19 + 20 +
//         21 + 22 + 23 + 24 + 25 + 26 + 27 + 28 + 29 + 30 + 31 + 32 + 33 + 34 + 35 + 36 + 37 + 38 +
//         39 + 40 + 41 + 42 + 43 + 44 + 45 + 46 + 47 + 48 + 49 + 50 + 51 + 52 + 53 + 54 + 55 + 56 +
//         57 + 58 + 59 + 60 + 61 + 62 + 63 + 64 + 65 + 66 + 67 + 68 + 69 + 70 + 71 + 72 + 73 + 74 +
//         75 + 76 + 77 + 78 + 79 + 80 + 81 + 82 + 83 + 84 + 85 + 86 + 87 + 88 + 89 + 90 + 91 + 92 +
//         93 + 94 + 95 + 96 + 97 + 98 + 99 + 100;
// console.log('Сумма чисел от 1 до 100 равна: ' + sum) // выведет 5050

// 17:26
// console.log('3 x 1 = ' + 3 * 1)
// console.log('3 x 2 = ' + 3 * 2)
// console.log('3 x 3 = ' + 3 * 3)
// console.log('3 x 4 = ' + 3 * 4)
// console.log('3 x 5 = ' + 3 * 5)
// console.log('3 x 6 = ' + 3 * 6)
// console.log('3 x 7 = ' + 3 * 7)
// console.log('3 x 8 = ' + 3 * 8)
// console.log('3 x 9 = ' + 3 * 9)
// console.log('3 x 10 = ' + 3 * 10)

// let number = 4;
// console.log(`Таблица умножения для числа ${number}:`);

// for (let i = 1; i <= 10; i++) {
//     console.log(`${number} × ${i} = ${number * i}`);
// }




